[
    {
        "author": "Sandra Chow",
        "email": "sandra.chow@keystoneacademy.cn",
        "position": "Director of Digital Learning",
        "employer": "Keystone Academy",
        "text": "Jordan has supported our school over the past two years on data and systems project. He is keen to connect with users, understand their pain points, and develop solutions that will help to improve the flow and function within the school. His educational background allows him to relate to the day-to-day needs of a school to come up with solutions that actually work and improve the operations of the school. In particular he has used Sharepoint to build a school-wide communication hub, Power Platforms to build student support systems and PowerBI to visualize school data to inform teaching, learning and school decisions, amongst many other projects. I can truly say that Jordan has made our school a better place through his efforts.",
        "excerpt": "His educational background allows him to relate to the day-to-day needs of a school to come up with solutions that actually work and improve the operations of the school. In particular he has used Sharepoint to build a school-wide communication hub, Power Platforms to build student support systems and PowerBI to visualize school data to inform teaching,"
    },
    {
        "author": "Jeff Heitmann",
        "email": "jeffrey.heitmann@keystoneacademy.cn",
        "position": "WASC Coordinator",
        "employer": "Keystone Academy",
        "text": "Jordan helped us understand how to use data we collected for our WASC review in a way that helped us understand better our challenges and successes as a school. Through the use of Power BI, we were able to mine data in a more profound way to give us answers we were seeking about our student and teacher well-being, professional development an d experiential education program.",
        "excerpt": "Jordan was indispensable for helping us collect and use data to tell our story as a school. Generating the WASC report required a lot of collaboration, and it was brought together with the help of Jordan's data prowess."
    }
]
